PracticalTask501/src/Documents/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажи</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

PracticalTask501/src/Documents/Продажи/Forms/ФормаДокумента/Module.bsl
//@strict-types

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанныеТовары = Элементы.Товары.ТекущиеДанные;
	ПересчетСуммы(ТекущиеДанныеТовары);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанныеТовары = Элементы.Товары.ТекущиеДанные;
	ПересчетСуммы(ТекущиеДанныеТовары);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Процедура производит пересчет Суммы в ТЧ Товары.
//
// Параметры:
//  ТекущиеДанныеТовары - ДанныеФормыЭлементКоллекции - ТекущиеДанные ТЧ Товары
//
&НаКлиенте
Процедура ПересчетСуммы(ТекущиеДанныеТовары)
	ТекущиеДанныеТовары.Сумма = ТекущиеДанныеТовары.Цена * ТекущиеДанныеТовары.Количество;	
КонецПроцедуры
#КонецОбласти
